tutorials/fluidSolidInteraction.monolithic/cavityFlexibleBottom/base/quasiMonolitic/constant/fluid/fluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fluidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidModel    newtonIcoFluid;

newtonIcoFluidCoeffs
{
    // Force an implicit flux
    forceImplicitFlux yes;

    // If the flux is explicit, specific the extrapolation approach
    // This is not used if forceImplicitFlux is enabled
    fluidFluxExtrapolationAlgorithm1 yes;

    // Additional divU term which is meant to improve convergence
    addDivPhiUDamping no;

    // Scaling of pressure equation relative to the momentum
    pressureScaleFactor 1.0;

    // Pressure stabilisation approach
    stabilisation
    {
        type RhieChow;
        scaleFactor 1.0;

        // type laplacian;
        // omega omega [0 -2 1 0 0 0 0] 1.0;
    }

    // Unused
    optionsFile    petscOptions.Up;
}

// ************************************************************************* //
