tutorials/fluidSolidInteraction.monolithic/cavityFlexibleBottom/base/quasiMonolitic/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel    nonLinearGeometryTotalLagrangianVelocity;

nonLinearGeometryTotalLagrangianVelocityCoeffs
{
    linearElasticFormulation yes;
    // E           E [1 -1 -2 0 0 0 0] 1e4;
    // nu          nu [0 0 0 0 0 0 0] 0.4;

    mu      mu  [1 -1 -2 0 0 0 0] 178.5714;
    lambda  lambda [1 -1 -2 0 0 0 0] 714.2857;

    futureForceFraction 1;

    dampingCoeff [0 0 -1 0 0 0 0] 1e-1;

    stabilisation
    {
        scaleFactor 0.1;
    }
}

// ************************************************************************* //
