tutorials/fluidSolidInteraction.monolithic/cavityFlexibleBottom/base/quasiMonolitic/system/solid/blockMeshDict.4
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (2 -0.4 0)
    (6 -0.4 0)
    (6 0 0)
    (2 0 0)

    (2 -0.4 1)
    (6 -0.4 1)
    (6 0 1)
    (2 0 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (320 32 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    interface
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    left
    {
        type patch;
        faces
        (
           (0 4 7 3)
        );
    }

    right
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (4 0 1 5)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
